const allLessonsData = {
    // ================= 第一課 =================
    "1": {
        title: "第一課：最美的模樣",
        level1: [
            { word: "撐", parts: ["images/L1/筆順-撐-部件-1.png", "images/L1/筆順-撐-部件-2.png", "images/L1/筆順-撐-部件-3.png"], pos: [{x: 70, y: 180, scale: 1.6}, {x: 120, y: 180}, {x: 170, y: 180}] },
            { word: "首", parts: ["images/L1/筆順-首-部件-1.png", "images/L1/筆順-首-部件-2.png"], pos: [{x: 120, y: 110}, {x: 120, y: 160}] },
            { word: "符", parts: ["images/L1/筆順-符-部件-1.png", "images/L1/筆順-符-部件-2.png", "images/L1/筆順-符-部件-3.png"], pos: [{x: 70, y: 180, scale: 1.6}, {x: 120, y: 180}, {x: 170, y: 180}] },
            { word: "膀", parts: ["images/L1/筆順-膀-部件-1.png", "images/L1/筆順-膀-部件-2.png"], pos: [{x: 100, y: 180}, {x: 170, y: 180}] },
            { word: "鼻", parts: ["images/L1/筆順-鼻-部件-1.png", "images/L1/筆順-鼻-部件-2.png", "images/L1/筆順-鼻-部件-3.png"], pos: [{x: 120, y: 90}, {x: 120, y: 140}, {x: 120, y: 190, scale: 1.5}] },
            { word: "環", parts: ["images/L1/筆順-環-部件-1.png", "images/L1/筆順-環-部件-2.png", "images/L1/筆順-環-部件-3.png", "images/L1/筆順-環-部件-4.png", "images/L1/筆順-環-部件-5.png"], pos: [{x: 50, y: 180}, {x: 90, y: 180}, {x: 130, y: 180}, {x: 170, y: 180, scale: 0.6}, {x: 210, y: 180}] },
            { word: "搗", parts: ["images/L1/筆順-搗-部件-1.png", "images/L1/筆順-搗-部件-2.png", "images/L1/筆順-搗-部件-3.png"], pos: [{x: 70, y: 180}, {x: 120, y: 180}, {x: 170, y: 180, scale: 0.5}] },
            { word: "亂", parts: ["images/L1/筆順-亂-部件-1.png", "images/L1/筆順-亂-部件-2.png", "images/L1/筆順-亂-部件-3.png", "images/L1/筆順-亂-部件-4.png"], pos: [{x: 90, y: 130}, {x: 150, y: 130}, {x: 90, y: 180, scale: 0.65}, {x: 150, y: 180, scale: 1.6}] },
            { word: "恐", parts: ["images/L1/筆順-恐-部件-1.png", "images/L1/筆順-恐-部件-2.png", "images/L1/筆順-恐-部件-3.png"], pos: [{x: 120, y: 90, scale: 0.6}, {x: 120, y: 140}, {x: 120, y: 190, scale: 1.5}] },
            { word: "尖", parts: ["images/L1/筆順-尖-部件-1.png", "images/L1/筆順-尖-部件-2.png"], pos: [{x: 120, y: 110}, {x: 120, y: 160}] },
            { word: "嘴", parts: ["images/L1/筆順-嘴-部件-1.png", "images/L1/筆順-嘴-部件-2.png", "images/L1/筆順-嘴-部件-3.png"], pos: [{x: 70, y: 180, scale: 0.6}, {x: 120, y: 180}, {x: 170, y: 180}] },
            { word: "吼", parts: ["images/L1/筆順-吼-部件-1.png", "images/L1/筆順-吼-部件-2.png"], pos: [{x: 100, y: 180, scale: 0.6}, {x: 170, y: 180}] }
        ],
        level2: [],
        level3: [
            { text: "天上有許多白白的________，像棉花糖一樣。", answer: "雲朵" },
            { text: "小狗開心的________真可愛。", answer: "模樣" },
            { text: "妹妹圓圓的________紅通通，像蘋果。", answer: "臉蛋" },
            { text: "五線譜上有許多會跳舞的________。", answer: "音符" },
            { text: "小鳥拍拍________，飛向藍天。", answer: "翅膀" },
            { text: "調皮的小貓在客廳________，把東西都弄翻了。", answer: "搗亂" },
            { text: "很久以前，地球上住著巨大的________。", answer: "恐龍" },
            { text: "森林裡的獅子大聲________，把小兔嚇跑了。", answer: "吼叫" },
            { text: "外面下雨了，出門要記得帶________。", answer: "雨傘" },
            { text: "這是一首好聽的曲子，________在那裡跳來跳去。", answer: "音符" }
        ],
        level4: []
    },

    // ================= 第二課 =================
    "2": { 
        title: "第二課：玩玩具", 
        level1: [], 
        level2: [], 
        level3: [
            { text: "看到同學有新玩具，我好________他。", answer: "羨慕" },
            { text: "妹妹轉一個圈，漂亮的________也跟著動。", answer: "裙擺" },
            { text: "我太累了，想在沙發上________休息。", answer: "躺下" },
            { text: "看到好朋友，小明臉上露出甜甜的________。", answer: "笑容" },
            { text: "大家一起用力________，把大箱子移開。", answer: "推動" },
            { text: "媽媽把好喝的湯裝在________裡。", answer: "湯碗" },
            { text: "小羊的毛彎彎的，好像漂亮的________。", answer: "捲髮" },
            { text: "以前的小朋友喜歡在空地上玩滾________。", answer: "鐵環" },
            { text: "牆壁上有一個________，可以用來掛外套。", answer: "彎鉤" }
        ], 
        level4: [] 
    },

    // ================= 第三課 =================
    "3": { 
        title: "第三課：愛玉的變身術", 
        level1: [], 
        level2: [], 
        level3: [
            { text: "太陽好大，天氣很________。", answer: "炎熱" },
            { text: "我喜歡吃冰冰涼涼的________。", answer: "愛玉" },
            { text: "蛋糕是甜甜的________。", answer: "甜品" },
            { text: "衣服洗好了，拿去太陽下________。", answer: "曬乾" },
            { text: "小狗的身上有黑色的________。", answer: "斑點" },
            { text: "我們在水裡用力________愛玉子。", answer: "搓洗" },
            { text: "爸爸把水倒進透明的________。", answer: "容器" },
            { text: "把種子裝進白色的小________。", answer: "棉袋" },
            { text: "冰水裡加一點________，甜甜的好好喝。", answer: "糖水" }
        ], 
        level4: [] 
    },

    // ================= 第四課 =================
    "4": { 
        title: "第四課：揚修猜字", 
        level1: [
            { word: "闊", parts: ["images/L4/筆順-闊-部件-1.png", "images/L4/筆順-闊-部件-2.png", "images/L4/筆順-闊-部件-3.png", "images/L4/筆順-闊-部件-4.png"], pos: [{x: 90, y: 130, scale: 1.3}, {x: 150, y: 130, scale: 1.0}, {x: 90, y: 180, scale: 0.5}, {x: 150, y: 180, scale: 0.5}] },
            { word: "驚", parts: ["images/L4/筆順-驚-部件-1.png", "images/L4/筆順-驚-部件-2.png", "images/L4/筆順-驚-部件-3.png", "images/L4/筆順-驚-部件-4.png"], pos: [{x: 90, y: 130}, {x: 150, y: 130, scale: 0.7}, {x: 90, y: 180, scale: 1.0}, {x: 150, y: 180}] },
            { word: "應", parts: ["images/L4/筆順-應-部件-1.png", "images/L4/筆順-應-部件-2.png", "images/L4/筆順-應-部件-3.png", "images/L4/筆順-應-部件-4.png"], pos: [{x: 90, y: 130, scale: 1.4}, {x: 150, y: 130, scale: 0.7}, {x: 90, y: 180, scale: 0.7}, {x: 150, y: 180}] },
            { word: "酪", parts: ["images/L4/筆順-酪-部件-1.png", "images/L4/筆順-酪-部件-2.png", "images/L4/筆順-酪-部件-3.png"], pos: [{x: 70, y: 180}, {x: 120, y: 180, scale: 0.8}, {x: 170, y: 180, scale: 0.5}] },
            { word: "楊", parts: ["images/L4/筆順-楊-部件-1.png", "images/L4/筆順-楊-部件-2.png", "images/L4/筆順-楊-部件-3.png", "images/L4/筆順-楊-部件-4.png"], pos: [{x: 90, y: 130}, {x: 150, y: 130, scale: 0.5}, {x: 90, y: 180, scale: 0.6}, {x: 150, y: 180, scale: 0.6}] },
            { word: "修", parts: ["images/L4/筆順-修-部件-1.png", "images/L4/筆順-修-部件-2.png", "images/L4/筆順-修-部件-3.png", "images/L4/筆順-修-部件-4.png"], pos: [{x: 90, y: 130}, {x: 150, y: 130, scale: 0.5}, {x: 90, y: 180, scale: 0.7}, {x: 150, y: 180, scale: 0.7}] },
            { word: "報", parts: ["images/L4/筆順-報-部件-1.png", "images/L4/筆順-報-部件-2.png", "images/L4/筆順-報-部件-3.png", "images/L4/筆順-報-部件-4.png", "images/L4/筆順-報-部件-5.png"], pos: [{x: 50, y: 180}, {x: 90, y: 180, scale: 0.7}, {x: 130, y: 180, scale: 0.7}, {x: 170, y: 180, scale: 1.4}, {x: 210, y: 180}] },
            { word: "府", parts: ["images/L4/筆順-府-部件-1.png", "images/L4/筆順-府-部件-2.png", "images/L4/筆順-府-部件-3.png"], pos: [{x: 70, y: 180, scale: 1.6}, {x: 120, y: 180}, {x: 170, y: 180}] },
            { word: "名", parts: ["images/L4/筆順-名-部件-1.png", "images/L4/筆順-名-部件-2.png"], pos: [{x: 100, y: 180}, {x: 170, y: 180, scale: 0.7}] },
            { word: "丞", parts: ["images/L4/筆順-丞-部件-1.png", "images/L4/筆順-丞-部件-2.png", "images/L4/筆順-丞-部件-3.png", "images/L4/筆順-丞-部件-4.png"], pos: [{x: 90, y: 130, scale: 1.3}, {x: 150, y: 130, scale: 0.7}, {x: 90, y: 180, scale: 0.7}, {x: 150, y: 180, scale: 1.3}] },
            { word: "曹", parts: ["images/L4/筆順-曹-部件-1.png", "images/L4/筆順-曹-部件-2.png", "images/L4/筆順-曹-部件-3.png", "images/L4/筆順-曹-部件-4.png"], pos: [{x: 90, y: 130}, {x: 150, y: 130}, {x: 90, y: 180}, {x: 150, y: 180, scale: 0.7}] },
            { word: "智", parts: ["images/L4/筆順-智-部件-1.png", "images/L4/筆順-智-部件-2.png", "images/L4/筆順-智-部件-3.png"], pos: [{x: 70, y: 180}, {x: 120, y: 180, scale: 0.7}, {x: 170, y: 180}] },
            { word: "官", parts: ["images/L4/筆順-官-部件-1.png", "images/L4/筆順-官-部件-2.png"], pos: [{x: 100, y: 180}, {x: 170, y: 180, scale: 0.7}] },
            { word: "差", parts: ["images/L4/筆順-差-部件-1.png", "images/L4/筆順-差-部件-2.png", "images/L4/筆順-差-部件-3.png"], pos: [{x: 70, y: 180}, {x: 120, y: 180, scale: 0.7}, {x: 170, y: 180}] },
            { word: "思", parts: ["images/L4/筆順-思-部件-1.png", "images/L4/筆順-思-部件-2.png"], pos: [{x: 100, y: 180, scale: 0.7}, {x: 170, y: 180}] }
        ], 
        level2: [], 
        level3: [], 
        level4: [] 
    },

    // ================= 第五課 =================
    "5": { 
        title: "第五課：唱反調", 
        level1: [
            // 🌟 第五課生字匯入！(均為預設標準排列，若有需要再微調)
            { word: "鞠", parts: ["images/L5/筆順-鞠-部件-1.png", "images/L5/筆順-鞠-部件-2.png", "images/L5/筆順-鞠-部件-3.png", "images/L5/筆順-鞠-部件-4.png", "images/L5/筆順-鞠-部件-5.png"], pos: [{x: 50, y: 180}, {x: 90, y: 180}, {x: 130, y: 180}, {x: 170, y: 180}, {x: 210, y: 180}] },
            { word: "躬", parts: ["images/L5/筆順-躬-部件-1.png", "images/L5/筆順-躬-部件-2.png"], pos: [{x: 100, y: 180}, {x: 170, y: 180}] },
            { word: "弄", parts: ["images/L5/筆順-弄-部件-1.png", "images/L5/筆順-弄-部件-2.png"], pos: [{x: 100, y: 180}, {x: 170, y: 180}] },
            { word: "文", parts: ["images/L5/筆順-文-部件-1.png", "images/L5/筆順-文-部件-2.png"], pos: [{x: 100, y: 180}, {x: 170, y: 180}] },
            { word: "厲", parts: ["images/L5/筆順-厲-部件-1.png", "images/L5/筆順-厲-部件-2.png", "images/L5/筆順-厲-部件-3.png", "images/L5/筆順-厲-部件-4.png"], pos: [{x: 90, y: 130}, {x: 150, y: 130}, {x: 90, y: 180}, {x: 150, y: 180}] },
            { word: "鬥", parts: ["images/L5/筆順-鬥-部件-1.png", "images/L5/筆順-鬥-部件-2.png", "images/L5/筆順-鬥-部件-3.png", "images/L5/筆順-鬥-部件-4.png"], pos: [{x: 90, y: 130}, {x: 150, y: 130}, {x: 90, y: 180}, {x: 150, y: 180}] },
            { word: "千", parts: ["images/L5/筆順-千-部件-1.png", "images/L5/筆順-千-部件-2.png"], pos: [{x: 100, y: 180}, {x: 170, y: 180}] },
            { word: "普", parts: ["images/L5/筆順-普-部件-1.png", "images/L5/筆順-普-部件-2.png", "images/L5/筆順-普-部件-3.png", "images/L5/筆順-普-部件-4.png", "images/L5/筆順-普-部件-5.png"], pos: [{x: 50, y: 180}, {x: 90, y: 180}, {x: 130, y: 180}, {x: 170, y: 180}, {x: 210, y: 180}] },
            { word: "睜", parts: ["images/L5/筆順-睜-部件-1.png", "images/L5/筆順-睜-部件-2.png", "images/L5/筆順-睜-部件-3.png", "images/L5/筆順-睜-部件-4.png"], pos: [{x: 90, y: 130}, {x: 150, y: 130}, {x: 90, y: 180}, {x: 150, y: 180}] },
            { word: "閉", parts: ["images/L5/筆順-閉-部件-1.png", "images/L5/筆順-閉-部件-2.png", "images/L5/筆順-閉-部件-3.png"], pos: [{x: 70, y: 180}, {x: 120, y: 180}, {x: 170, y: 180}] },
            { word: "錢", parts: ["images/L5/筆順-錢-部件-1.png", "images/L5/筆順-錢-部件-2.png"], pos: [{x: 100, y: 180}, {x: 170, y: 180}] },
            { word: "偏", parts: ["images/L5/筆順-偏-部件-1.png", "images/L5/筆順-偏-部件-2.png", "images/L5/筆順-偏-部件-3.png", "images/L5/筆順-偏-部件-4.png"], pos: [{x: 90, y: 130}, {x: 150, y: 130}, {x: 90, y: 180}, {x: 150, y: 180}] },
            { word: "察", parts: ["images/L5/筆順-察-部件-1.png", "images/L5/筆順-察-部件-2.png", "images/L5/筆順-察-部件-3.png", "images/L5/筆順-察-部件-4.png"], pos: [{x: 90, y: 130}, {x: 150, y: 130}, {x: 90, y: 180}, {x: 150, y: 180}] },
            { word: "偷", parts: ["images/L5/筆順-偷-部件-1.png", "images/L5/筆順-偷-部件-2.png", "images/L5/筆順-偷-部件-3.png", "images/L5/筆順-偷-部件-4.png", "images/L5/筆順-偷-部件-5.png"], pos: [{x: 50, y: 180}, {x: 90, y: 180}, {x: 130, y: 180}, {x: 170, y: 180}, {x: 210, y: 180}] },
            { word: "胡", parts: ["images/L5/筆順-胡-部件-1.png", "images/L5/筆順-胡-部件-2.png", "images/L5/筆順-胡-部件-3.png"], pos: [{x: 70, y: 180}, {x: 120, y: 180}, {x: 170, y: 180}] }
        ], 
        level2: [], 
        level3: [], 
        level4: [] 
    },

    // ================= 第六課 =================
    "6": { title: "第六課：一飛沖天", level1: [], level2: [], level3: [], level4: [] },

    // ================= 第七課 =================
    "7": { title: "第七課：井仔腳鹽田", level1: [], level2: [], level3: [], level4: [] },

    // ================= 第八課 =================
    "8": { title: "第八課：和魚一起游泳", level1: [], level2: [], level3: [], level4: [] },

    // ================= 第九課 =================
    "9": { title: "第九課：三峽老街樂藍染", level1: [], level2: [], level3: [], level4: [] },

    // ================= 第十課 =================
    "10": { title: "第十課：地球的眼淚", level1: [], level2: [], level3: [], level4: [] },

    // ================= 第十一課 =================
    "11": { title: "第十一課：枯木是大飯店", level1: [], level2: [], level3: [], level4: [] },

    // ================= 第十二課 =================
    "12": { title: "第十二課：騎樓", level1: [], level2: [], level3: [], level4: [] }
};
